final List<String> questions = [
  "คุณรู้สึกหมดความสนใจหรือไม่เพลิดเพลินกับกิจกรรมที่เคยชอบในอดีตหรือไม่?",
  "คุณรู้สึกซึมเศร้าหรือเศร้าหมองเป็นส่วนใหญ่หรือไม่?",
  "คุณมีปัญหาในการนอนหลับ (นอนไม่หลับหรือนอนมากเกินไป) หรือไม่?",
  "คุณรู้สึกเหนื่อยล้าหรือไม่มีพลังงานตลอดเวลาหรือไม่?",
  "คุณรู้สึกเบื่อหน่ายหรือไม่มีแรงจูงใจในการทำกิจกรรมต่าง ๆ หรือไม่?",
  "คุณมีความรู้สึกว่าตนเองเป็นคนที่ล้มเหลวหรือรู้สึกผิดในตนเองบ่อยเพียงใด?",
  "คุณประสบปัญหาในการมีสมาธิหรือการตัดสินใจในการทำงานหรือกิจกรรมต่าง ๆ หรือไม่?",
  "คุณรู้สึกว่าการเคลื่อนไหวหรือการพูดของคุณช้าลงเมื่อเทียบกับปกติหรือไม่?",
  "คุณมีความคิดที่จะทำร้ายตนเองหรือจบชีวิตตนเองหรือไม่?",
];

final Map<int, String> options = {
  0: "0 = ไม่เลย",
  1: "1 = บางครั้ง",
  2: "2 = บ่อย",
  3: "3 = เกือบทุกวัน",
};

int calculateScore(List<int?> answers) {
  return answers.fold(0, (total, answer) => total + (answer ?? 0));
}

String getResultInterpretation(int score) {
  if (score <= 4) return "สภาวะสุขภาพจิตในระดับปกติ";
  if (score <= 9) return "อาจมีอาการซึมเศร้าในระดับเล็กน้อย";
  if (score <= 14) return "อาการซึมเศร้าระดับปานกลาง";
  if (score <= 19) return "อาการซึมเศร้าค่อนข้างรุนแรง";
  return "อาการซึมเศร้ารุนแรง";
}
